<?php
namespace controllers;


/**
 * Class UserController
 * @package controllers
 * =============================================================================================
 * Класс для
 * 1) отображения странички пользователя
 * 2) Возможности писать записи со своей странички
 * =============================================================================================
 */
class UserController extends CoreController
{
    /**
     * =========================================================================================
     * Персональная страничка пользователя
     * =========================================================================================
     */
    public function actionIndex()
    {
        return $this->getSmarty()->display('user/index.tpl');
    }

    /**
     * ==========================================================================================
     * Посмотреть страничку другого пользователя
     * ==========================================================================================
     */
    public function actionShow(){}




}